const courses = [
  {
    id: 1,
    title: "B057 Информационные технологии",
    description:
      "Программа направлена на подготовку специалистов в области разработки программного обеспечения, системного анализа и других IT-направлений.",
  },
  {
    id: 2,
    title: "B058 Информационная безопасность",
    description:
      "Обучение специалистов по защите информации и кибербезопасности.",
  },
  {
    id: 3,
    title: "B059 Коммуникации и коммуникационные технологии",
    description:
      "Фокус на телекоммуникационных системах и сетях.",
  },
  {
    id: 4,
    title: "B042 Журналистика и репортерское дело",
    description:
      "Подготовка специалистов в области медиа и коммуникаций.",
  },
  {
    id: 5,
    title: "B044 Менеджмент и управление",
    description:
      "Программы, ориентированные на электронный бизнес и инновационный менеджмент.",
  },
  {
    id: 6,
    title: "B046 Финансы, экономика, банковское и страховое дело",
    description:
      "Подготовка специалистов в области финансов, экономики и банковского дела.",
   
  },
];

export default courses;
